//给定一个整数，编写一个函数来判断它是否是 2 的幂次方。
//
// 示例 1:
//
// 输入: 1
//输出: true
//解释: 20 = 1
//
// 示例 2:
//
// 输入: 16
//输出: true
//解释: 24 = 16
//
// 示例 3:
//
// 输入: 218
//输出: false
// Related Topics 位运算 数学
public class L_231_2的幂 {

    /**
     * 2的幂次方特点：n & n-1 == 0
     * 例：
     * n=4     0000,0100
     * n-1=3   0000,0011
     * n&n-1 = 0000,0000
     *
     * n=6     0000,0110
     * n-1=5   0000,0101
     * n&n-1 = 0000,0100
     */
    public boolean isPowerOfTwo(int n) {
        return n > 0 && (n & (n - 1)) == 0;
    }

}
